app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "30"]]
UPDATE "users" SET "name" = 'z2', "password_digest" = '$2a$10$iPdjL547pR9bzS4AL/6NXuiK/zizl9khY4G.d5FXaUW3zk52DrArq', "remember_token" = 'vnFYMlvrZ-ehPPRHQc3Xyg', "updated_at" = '2016-12-21 10:07:40.228959' WHERE "users"."id" = 30

  def create
	   @user = User.new(params[:user])
	   if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)